//
//  AnimeModel.swift
//  bookingTable
//
//  Created by Admin on 17.03.2022.
//

import SwiftUI

// Этот глупый свин не понимает мечту девочки зайки
var SynopsisBunnySenpaiGirl = "Однажды старшеклассник Сакута встречает Май – известную актрису, на которую никто не обращает внимания, несмотря на то, что девушка одета в вызывающий костюм кролика. Юноша решает помочь Май выяснить, почему люди перестали её замечать."
var genreBunnySenpaiGirl = ["аниме", "мультфильм", "комедия", "мелодрама", "фэнтези"]
var timeBunnySenpaiGirl = ["12:00", "17:20", "19:50", "23:00"]

// Токийский Гуль
var SynopsisTokyoGhoul = "С обычным студентом Кэном Канэки случается беда, парень попадает в больницу. Но на этом неприятности не заканчиваются: ему пересаживают органы гулей – существ, поедающих плоть людей. После злосчастной операции Канэки становится одним из чудовищ, пытается стать своим, но для людей он теперь изгой, обреченный на уничтожение."
var genreTokyoGhoul = ["аниме", "мультфильм", "ужасы", "боевик", "фэнтези", "триллер", "драма"]
var timeTokyoGhoul = ["10:00", "16:20"]



