//
//  CartoonModel.swift
//  bookingTable
//
//  Created by Admin on 03.04.2022.
//

import SwiftUI

// Плохие парни
var SynopsisTheBadGuys = "Мир еще не видел столь искусных авантюристов: ловкий карманник Мистер Волк, опытный взломщик сейфов Мистер Змей, хладнокровный мастер маскировки Мистер Акула, вспыльчивый и мускулистый Мистер Пиранья, а также остроумная хакер высшего класса Мисс Тарантула. Однако даже самые умные преступники иногда допускают ошибки. Чтобы спастись от неминуемый тюрьмы, главарь банды Мистер Волк вынужден идти на крайние меры: «Плохие парни» должны измениться в лучшую сторону. Или сделать вид? Но когда новый злодей угрожает городу, сможет ли Мистер Волк убедить остальных действительно стать… хорошими ребятами?"
var genreTheBadGuys = ["мультфильм", "комедия", "криминал", "приключения", "семейный"]
var timeTheBadGuys = ["10:30", "15:40", "16:20", "21:50"]

// Этот дом
var SynopsisTheHouse = "История дома, в который в разные периоды заезжают новые обитатели и сталкиваются со сверхъестественными существами, сводящими их с ума."
var genreTheHouse = ["мультфильм", "драма", "комедия", "фэнтези"]
var timeTheHouse = ["10:30", "15:40", "16:20", "21:50"]
