//
//  FilmModel.swift
//  bookingTable
//
//  Created by Admin on 01.04.2022.
//

import SwiftUI
// Крестный отец
var SynopsisGodFather = "Криминальная сага, повествующая о нью-йоркской сицилийской мафиозной семье Корлеоне. Фильм охватывает период 1945-1955 годов. Глава семьи, Дон Вито Корлеоне, выдаёт замуж свою дочь. В это время со Второй мировой войны возвращается его любимый сын Майкл. Майкл, герой войны, гордость семьи, не выражает желания заняться жестоким семейным бизнесом. Дон Корлеоне ведёт дела по старым правилам, но наступают иные времена, и появляются люди, желающие изменить сложившиеся порядки. На Дона Корлеоне совершается покушение."
var genreGodFather = ["драма", "криминал"]
var timeGodFather = ["10:30", "15:40", "16:20", "21:50"]

// Бойцовский клуб
var SynopsisFightClub = "Сотрудник страховой компании страдает хронической бессонницей и отчаянно пытается вырваться из мучительно скучной жизни. Однажды в очередной командировке он встречает некоего Тайлера Дёрдена — харизматического торговца мылом с извращенной философией. Тайлер уверен, что самосовершенствование — удел слабых, а единственное, ради чего стоит жить — саморазрушение. Проходит немного времени, и вот уже новые друзья лупят друг друга почем зря на стоянке перед баром, и очищающий мордобой доставляет им высшее блаженство. Приобщая других мужчин к простым радостям физической жестокости, они основывают тайный Бойцовский клуб, который начинает пользоваться невероятной популярностью."
var genreFightClub = ["драма", "криминал", "триллер"]
var timeFightClub = ["12:30", "18:40", "22:50"]

// Бётмен
var SynopsisBatMan = "После двух лет поисков правосудия на улицах Готэма для своих сограждан Бэтмен становится олицетворением беспощадного возмездия. Когда в городе происходит серия жестоких нападений на представителей элиты, улики приводят Брюса Уэйна в самые темные закоулки преступного мира, где он встречает Женщину-Кошку, Пингвина, Кармайна Фальконе и Загадочника. Теперь под прицелом оказывается сам Бэтмен, которому предстоит отличить друга от врага и восстановить справедливость во имя Готэма."
var genreBatMan = ["драма", "криминал", "боевик", "детектив"]
var timeBatMan = ["12:30", "18:40", "22:50"]

// Дюна
var SynopsisDuna = "Наследник знаменитого дома Атрейдесов Пол отправляется вместе с семьей на одну из самых опасных планет во Вселенной — Арракис. Здесь нет ничего, кроме песка, палящего солнца, гигантских чудовищ и основной причины межгалактических конфликтов — невероятно ценного ресурса, который называется меланж. В результате захвата власти Пол вынужден бежать и скрываться, и это становится началом его эпического путешествия. Враждебный мир Арракиса приготовил для него множество тяжелых испытаний, но только тот, кто готов взглянуть в глаза своему страху, достоин стать избранным."
var genreDuna = ["фантастика", "боевик", "драма", "приключения"]
var timeDuna = ["12:30", "18:40", "22:50"]

// TheBeatles:GetBack
var SynopsisTheBeatlesGetBack = "Конец 60-х. Отношения между участниками Битлз накалены, планы рушатся, но именно в этот период сочиняются и исполняются одни из самых знаковых песен в мире."
var genreTheBeatlesGetBack = ["документальный", "музыка"]
var timeTheBeatlesGetBack = ["12:30", "18:40", "22:50"]

//HarryPotter20thAnniversary
var SynopsisHarryPotter20thAnniversary = "Дэниэл Рэдклифф, Руперт Гринт и Эмма Уотсон встретятся со своими коллегами и впервые за долгие годы окажутся в стенах Хогвартса."
var genreHarryPotter20thAnniversary = ["документальный", "Семейный"]
var timeHarryPotter20thAnniversary = ["12:30", "18:40", "22:50"]

//And Just Like That...
var SynopsisAndJustLikeThat = "Документальная программа рассказывает о том, как создавалось продолжение «Секса в большом городе», мини-сериал «И просто так…». Закадровые съемки показывают, как создавался сценарий, как подбирались костюмы, как ведущие актрисы влияли на съемочный процесс по обе стороны от камеры и заново вживались в свои образы спустя 18 лет после закрытия оригинального шоу."
var genreAndJustLikeThat = ["документальный"]
var timeAndJustLikeThat = ["12:30", "18:40", "22:50"]

//Bobby en de Geestenjagers
var SynopsisBobbyendeGeestenjagers = "Подросток по имени Санне очень интересуется пугающими историями о привидениях, злых духах и других таинственных и необъяснимых вещах, о которых он наслышан с раннего детства. Дело в том, что его отец Лукас является очень известным охотником за привидениями, и он часто рассказывает сыну занимательные истории. И вот однажды Лукас получает задание отправиться на бывший морской лайнер «Роттердам», чтобы выяснить причину происходящих там странных вещей. Он берет сына с собой на задание. На заброшенном лайнере Санне встречает мальчика по имени Бобби примерно своего возраста и твердо решает ему помочь. Вот только возможно ли помочь призраку, или Бобби — самый что ни есть реальный человек?"
var genreBobbyendeGeestenjagers = ["семейный"]
var timeBobbyendeGeestenjagers = ["12:30", "18:40", "22:50"]

//Briefgeheim
var SynopsisBriefgeheim = "У 11-летней Евы не ладится с родителями, и для того, чтобы родители поняли, как она ужасно себя чувствует, девочка убегает из дома. Ева прячется на чердаке своих друзей. Но неожиданно ее план принимает другой оборот, когда она находит письмо и узнает, что ее сосед — глава преступной организации."
var genreBriefgeheim = ["семейный","криминал", "драма"]
var timeBriefgeheim = ["12:30", "18:40", "22:50"]

//TheCallOfTheWild
var SynopsisTheCallOfTheWild = "История Бака, дружелюбного пса, чья размеренная домашняя жизнь перевернулась с ног на голову во времена золотой лихорадки в 1880-х, когда его вырвали из дома в Калифорнии и перевезли в дикую и холодную Аляску. Будучи новичком в упряжке почтовой службы, а впоследствии лидером, Бак попадает в невероятное приключение, находит свое место в мире и становится хозяином своей жизни."
var genreTheCallOfTheWild = ["семейный","приключения", "драма"]
var timeTheCallOfTheWild = ["12:30", "18:40", "22:50"]

//Maeumi
var SynopsisMaeumi = "11-летний Чан присматривает за младшей сестрёнкой после того, как мама уехала на заработки в Сеул. Однажды мальчик дарит сестре на день рождения щенка лабрадора, и тот становится полноправным членом семьи. Кажется, новая семья обрела уют и покой, когда происходит несчастный случай."
var genreMaeumi = ["семейный","криминал", "драма"]
var timeMaeumi = ["12:30", "18:40", "22:50"]

//Pollyanna
var SynopsisPollyanna = "После смерти родителей 11-летнюю девочку Поллианну забрала к себе ее тетя Полли, известная своим суровым характером. Из атмосферы родительской любви Поллианна переселилась в мир строгих правил и запретов. Но она не сдавалась! Отец научил девочку простой и забавной игре — уметь радоваться жизни при любых обстоятельствах. Всегда веселая Поллианна раздражала своим оптимизмом не только свою тетю, но и других жителей унылого городка, которые считали, что им нечему радоваться. Вскоре все они познакомились с необычной игрой Поллианны и их жизнь стала меняться! Но однажды с Поллианной случилось несчастье, казалось не оставляющее надежды на лучшее… Сможет ли она преодолеть навалившуюся беду и сохранить радость в своем сердце?"
var genrePollyanna = ["семейный"]
var timePollyanna = ["12:30", "18:40", "22:50"]

//WhatDidSenkaHave
var SynopsisWhatDidSenkaHave = "Пятилетний Сенька остался в доме хозяином: отец повез маму в роддом. Мальчик считал, что у него должен быть только брат, потому что в хозяйстве лишние руки не помешают. Но вот вместо обещанного братика появилась сестренка Оля. Трудно было примириться Сеньке с этим вечно плачущим существом, завладевшим вниманием родителей. Зная, что их соседка всю жизнь мечтает о дочке, он подбросил малышку к ней в огород..."
var genreWhatDidSenkaHave = ["семейный"]
var timeWhatDidSenkaHave = ["12:30", "18:40", "22:50"]
